Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow
The Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow class provides a window to get the user input text.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.LostFocusMessage
The WM_KILLFOCUS message.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.PosChangingMessage
The WM_WINDOWPOSCHANGING message.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.PosChangedMessage
The WM_WINDOWPOSCHANGED message.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.NonClientActivateMessage
The WM_NCACTIVATE message.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.Instance
The instance.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.SyncObject
The synchronize object.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.isChangingPosition
A value indicating whether the position is being changed.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow class.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.InputText
Gets the value.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.TextBox
Gets the text box.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.Container
Gets the container.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.RequestString(System.String)
Requests the input.
initialValue: The initial value.
Returns: The input string, if any.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.Interrupt
Interrupts this instance.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.OnPreviewKeyDown(System.Windows.Input.KeyEventArgs)
Handles the preview keydown event.
eventArgs: The System.Windows.Input.KeyEventArgs instance containing the event data.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.OnClosing(System.ComponentModel.CancelEventArgs)
Raises the Closing event.
eventArgs: The System.ComponentModel.CancelEventArgs instance containing the event data.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.OnElementHit(System.Windows.DependencyObject)
Called when the element is hit.
target: The hit element visual hit.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.ShowWindow(System.String)
Shows the input window.
initialValue: The initial value.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.GetFontName
Gets the name of the font.
Returns: The name of the font.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.GetFontSize
Gets the size of the font.
Returns: The size of the font.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.OnPreviewMouseDown(System.Windows.Input.MouseButtonEventArgs)
Raises the PreviewMouseDown event.
eventArgs: The System.Windows.Input.MouseButtonEventArgs instance containing the event data.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.CreateTextBox
Creates the text box.
Returns: The text box.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.OnIsVisibleChanged(System.Object,System.Windows.DependencyPropertyChangedEventArgs)
Called when the visibility has been changed.
sender: The sender.
eventArgs: The System.Windows.DependencyPropertyChangedEventArgs instance containing the event data.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.HandleWindowMessage(System.IntPtr,System.Int32,System.IntPtr,System.IntPtr,System.Boolean@)
Handles window message.
hwnd: The HWND.
msg: The MSG.
paramW: The window parameter.
paramL: The additional window parameter.
handled: If set to true, handled.
Returns: The handle pointer.

Tekla.Structures.DirectManipulation.Adapter.Controls.TextInputWindow.UpdateTextbox
Updates the textbox.